{
  "writings": [
    {
      "title": "2019 DSE English",
      "body": "Introduction \n\rThe purpose of this report is to illustrate the reason why Brighthouse Cinema is an unsuitable venue for the screening of “The Electronic Durian” on 19 June (Wednesday).  The details regarding facilities and hygienic concerns of the venue are discussed as follows.\n\nOur requirements\nThe facilities of Brighthouse Cinema fail to meet our requirements in certain aspects. One of the major concerns is the unavailability of ramps for wheelchairs. Ms Isabel Luna, our director who mobilizes in a wheelchair due to a skateboard accident, needs access onto the stage for a post-screening discussion. Brighthouse Cinema, however, is not equipped with wheelchair access onto the stage, creating inconvenience for our guests.\n\nApart from wheelchair access, we plan to offer noodles to the audience to eat during screening for the full experience. The fact that Brighthouse Cinema does not allow outside food diminishes the key fun element of the screening. \n\nAvailability of staff\nAccording to our plan, at least ten ushers are required to distribute 3D headsets to the audience before the screening. Nonetheless, only four ushers could be provided by the cinema. This further proves that Brighthouse Cinema is undesirable fore.\n\nHygienic & Safety concern\nIt is revealed that Brighthouse Cinema failed the governed hygiene inspection in 2016, and it remained unlicensed for one year. According to Cross-department Regulations for Cinema issued by the government, it is clearly stated that cinemas should be cleaned once a day while the emergency exit signs should be in both English and Chinese. Yet, Brighthouse Cinema is cleaned only once every two days, whereas their emergency exit signs are in English only.\n\nConclusion\nIt is manifest that Brighthouse Cinema is unsuitable and undesirable for our screening given that it fails to meet our requirements while the cleanliness of the cinema is doubtful. In order to provide our audience with the best screening experience, reselecting another venue is preferred.",
      "author": "mario",
      "accuracy": 0.643,
      "id": "dse2019",
      "attempt_id": 2,
      "report": {
        "task_comp": {
          "grade": 5,
          "full_mark": 9,
          "comments": "The article effectively addresses the task of illustrating why Brighthouse Cinema is an unsuitable venue for the screening of \"The Electronic Durian\" on 19 June (Wednesday). It highlights specific requirements and concerns that make the venue unfavorable."
        },
        "lang": {
          "grade": 3,
          "full_mark": 5,
          "comments": "The language used in the article is clear and concise, allowing the reader to understand the points being made. The author effectively communicates their concerns about the venue's facilities, staff availability, and hygiene/safety."
        },
        "cohesion": {
          "grade": 1,
          "full_mark": 2,
          "comments": "The article maintains an appropriate tone and style for a report. It presents the information objectively and focuses on factual details to support the argument against Brighthouse Cinema as a suitable venue."
        },
        "appropriacy": {
          "grade": 1,
          "full_mark": 2,
          "comments": "The overall structure and cohesion of the comment are commendable. The writer effectively organises their ideas, allowing for a logical flow of information. The comment demonstrates coherence and unity, which enhances its clarity and readability."
        }
      },
      "skill_graph": {
        "completeness": {
          "mark": 9,
          "average": 6
        },
        "organization": {
          "mark": 7,
          "average": 5
        },
        "tone": {
          "mark": 6,
          "average": 7
        },
        "logic": {
          "mark": 8,
          "average": 4
        },
        "grammar": {
          "mark": 5,
          "average": 6
        },
        "vocabulary": {
          "mark": 6,
          "average": 6
        }
      }
    },
    {
      "title": "2018 DSE English",
      "body": "Though Brighthouse Cinema Is the cheapest of the three venne of the screening of the fratricle Durian and post-sereening discussion and within the Festhal budget, we worried abont the sultabillty of it. Also, there is rumors that the Brighthouse cinema failed a government inspection prevlously.\nPlease read the following below and see should we choose choose\nThis venne:\n\nProblem of Brighthouse Cinema:\nAfter a site visit by Ala Kapoor, we found out wheelchair access into auditorium for andlence, but more concerns follow by this good facility, such as stafe can only be accessed from stairs.\n\nAs the manayer of Brighthouse Cinema said no outside food is allowed, meaning that we cannot bring noodles' to let andlence to eat while they are watching The flectionde Durian. This is a long firm element, without it, it win be a big lose.\n\nAlso, we will provide 3D headsets and audiance have to hand out them before leaving the cinema. Time taken may be too long\n\nMoreover, Mr Amy said there is no possibillty of having more than 4 ushers\n\nBesides, The Brighthouse Cinema faild government hygiene Inspection in 2016, and lost icence for 12 months. The is rumors arouse by that may affat the bratwale Dimen\n\nlast but not least, the Exit syrs and Emergency Exits are only in English, but according to the Government Cross-departmental Regulations for cinemas and Theatres, in order to ensure the safe and prompt evacuation of the cinema in case of emergency, all exits must be indicated by illuminated signs bearing the word “Exit” in English and Chinese. The Brighthouse Cinema is not following the regulation.\n\nPlease think twice to select a suitable venue for the coming events.",
      "author": "mario",
      "accuracy": 0.599,
      "id": "dse2018",
      "attempt_id": 1
    },
    {
      "title": "2020 DSE Enlish",
      "body": "Report of Brighthouse Cinema\nThe cinema’s conditions are not suitable enough for the committee to take this venue (as they are not matched with government cross-departmental registration for cinema and theatres). There are two some reasons.\n\nHygiene problems:\nThe cinema has only one cleaner who clean the cinema once for two days, and garbage taken away after every screening. However, two regulations said that it wants to clean at least once per day and must ensure that all rubbish is removed after each screening.\n\nFood\nThere is no outside food is allowed in the cinema. Therefore, there is no noodles the audience can eat for our screening.\n\nWheelchair\nThe stage of the cinema access from stair only and there is wheelchair ramp access onto the stage for Luna.\n\nStaff number\nThe number of staff is just 4 ushers and 1 ticket sales. It is not enough for our screening as there is many audience coming that day.\n\nPlease do not take the cinema for the screening as it is not suitable and there are many inconvenience for our screening.",
      "author": "mario",
      "id": "dse2020"
    },
    {
      "title": "Mock Exam 01",
      "body": "Introduction\nThe purpose of this report is to illustrate the reason why Brighthouse Cinema is an unsuitable venue for the screening of “The Electronic Durian” on 19 June (Wednesday).  The details regarding facilities and hygienic concerns of the venue are discussed as follows.\n\nOur requirements\nThe facilities of Brighthouse Cinema fail to meet our requirements in certain aspects. One of the major concerns is the unavailability of ramps for wheelchairs. Ms Isabel Luna, our director who mobilizes in a wheelchair due to a skateboard accident, needs access onto the stage for a post-screening discussion. Brighthouse Cinema，however, is not equipped with wheelchair access onto the stage, creating inconvenience for our guests.\n\nApart from wheelchair access, we plan to offer noodles to the audience to eat during screening for the full experience. The fact that Brighthouse Cinema does not allow outside food diminishes the key fun element of the screening. \n\nAvailability of staff\nAccording to our plan, at least ten ushers are required to distribute 3D headsets to the audience before the screening. Nonetheless, only four ushers could be provided by the cinema. This further proves that Brighthouse Cinema is undesirable fore.\n\nHygienic & Safety concern\nIt is revealed that Brighthouse Cinema failed the governed hygiene inspection in 2016, and it remained unlicensed for one year. According to Cross-department Regulations for Cinema issued by the government, it is clearly stated that cinemas should be cleaned once a day while the emergency exit signs should be in both English and Chinese. Yet, Brighthouse Cinema is cleaned only once every two days, whereas their emergency exit signs are in English only.\n\nConclusion\nIt is manifest that Brighthouse Cinema is unsuitable and undesirable for our screening given that it fails to meet our requirements while the cleanliness of the cinema is doubtful. In order to provide our audience with the best screening experience, reselecting another venue is preferred.\n",
      "author": "admin",
      "id": "mock01"
    }
  ]
}